[
  {
    "timestamp": "2026-01-24 16:00:55",
    "description": "# AI Digest - January 24, 2026\n\n## Tips & Techniques\n- **Reasoning Models Learn Through Internal Debate**: Google research shows reasoning models like DeepSeek-R1 and QwQ-32B exhibit \"society of thought\"—simulated disagreement between internal perspectives prevents echo-chamber reasoning. Models fine-tuned with conversational scaffolding learn faster than those trained on monologue-style reasoning. [link](https://x.com/geetkhosla/status/2015087393817158080)\n\n- **Tmux Sensei-Pupil Pattern for Self-Improving Agents**: One Claude instance in tmux controlling another creates a mentor-apprentice dynamic—the \"sensei\" learns from co-working sessions before taking full control. Practical approach for agents that improve through observation. [link](https://x.com/AhmedRezaT/status/2015065530101911598)\n\n- **Test Real Load, Not Benchmarks**: Developers massively underestimate single-machine throughput (60k RPS baseline, some handle 1M RPS per core). Run actual load tests instead of assuming you need distributed systems—infrastructure decisions are often premature. [link](https://x.com/_imdawon/status/2014720539559133347)\n\n- **Slack Kills Planning, Docs/Figma Enable It**: Half-baked thoughts flourish in chat. Moving planning exercises to Google Docs or Figma surfaces better analysis and faster execution. The tool shape matters for the thought quality it allows. [link](https://x.com/jnnnthnn/status/2015091653485416795)\n\n## New Tools & Releases\n- **Zo Computer**: Personal AI server (Mac Studio M3 Ultra demonstrated) with full OS access, file management, code execution, and calendar control. Your mom now runs her own research using Zo—signals shift from cloud apps to personal AI infrastructure. [link](https://x.com/0thernet/status/1991168644881985930)\n\n- **Claude in Excel (Pro)**: Native integration now available—Claude accepts multiple files via drag-and-drop, avoids overwriting existing data. Enterprise Excel users finally have a working copilot inside their primary tool. [link](https://x.com/DonDiegoArmando/status/2015083484985860436)\n\n- **Qwen3-TTS Open Source**: Alibaba's text-to-speech with voice instruction tuning running locally on Mac Studio M3 Ultra via MLX. Voice customization through prompts (\"speak with fear and panic\") works impressively well. [link](https://x.com/ivanfioravanti/status/2014696248167539147)\n\n- **EXO Release (FAILED→PREPARING Fix)**: Critical fix for state transition handling in distributed LLM inference. [link](https://x.com/ivanfioravanti/status/2015091328799883657)\n\n- **Skills Directory (10k+ in 72 hours)**: Cursor/Claude Code skills ecosystem exploding—Context7 extracted 24k skills from 65k repos covering Tailwind, React, auth libraries. Composable, reusable agent components becoming standard. [link](https://x.com/andrewqu/status/2014953089300848787)\n\n## Research & Papers\n- **Runtime Learning vs. Continual Learning Definition**: \"Runtime learning\" (systems that learn while being used) is what we actually need, not just continual learning without catastrophic forgetting. The distinction matters for building AGI that adapts mid-deployment. [link](https://x.com/akshatgupta57/status/2014438869627015564)\n\n- **Five Ways Intelligence Systems Fail**: Yann LeCun on deluded/stupid/ineffective systems: inaccurate perception, broken world models, poor search, misaligned objectives, defective guardrails. Mechanistic rather than mystical—guides what to fix. [link](https://x.com/lucas_flatwhite/status/2015089878682460459)\n\n- **DFlash: Diffusion Models as Drafters in Speculative Decoding**: 6.2× lossless speedup on Qwen-8B by using diffusion model drafts verified by autoregressive LLM. Diffusion vs. AR isn't binary—fusion is faster. [link](https://x.com/joelniklaus/status/2015077449529507969)"
  },
  {
    "timestamp": "2026-01-24 16:00:56",
    "description": "## Industry News\n- **Anthropic's $1.5B+ Funding Round**: Led by GIC and Coatue with Sequoia joining. Validates Claude Code and agent architecture dominance—enterprise betting heavily on Anthropic's execution layer strategy.\n\n- **Vibe Coding Unlocking iOS App Surge**: App Store growth after years of stagnation driven by AI-assisted development. Non-technical builders shipping real apps signals genuine productivity unlock, not hype. [link](https://x.com/solydzajs/status/2015085982190862360)\n\n- **Agent Skills Becoming Standardized Primitive**: With 10k+ skills deployed in 72 hours, agent composition via skills (not monolithic models) is becoming production standard. Orchestration + small, focused skills beats end-to-end monoliths.\n\n---\n*Curated from 800+ tweets across developer and AI research feeds*"
  }
]