[
  {
    "timestamp": "2026-02-11 16:01:27",
    "description": "# AI Digest - February 11, 2026\n\n## Industry News\n- **xAI Co-Founder Exodus Continues**: At least 11 people left xAI in a single day, including 5 of 12 original co-founders now gone. The unusually high churn rate raises questions about internal dynamics at the lab. [link](https://x.com/Yuchenj_UW/status/2021459613951066624)\n- **OpenAI Testing Ads in ChatGPT**: Former OpenAI employee resigned the same day the company started testing ads in ChatGPT, citing concerns over monetizing the detailed record of human candor users have shared. [link](https://x.com/zhitzig/status/2021503880548524471)\n- **Mistral Secures $1.2B for Swedish AI Center**: French AI company Mistral raising capital to build large-scale compute infrastructure, with investment from ASML potentially enabling deeper R&D expansion. [link](https://x.com/LeszBuk/status/2021611507390308591)\n\n## Tips & Techniques\n- **Ask Your Agent What Context It's Missing**: If an agent isn't doing what you want, try prompting \"Are you missing any context?\" This simple question can reveal gaps the model didn't know to ask about. [link](https://x.com/ibuildthecloud/status/2021612761583612279)\n- **Codex Desktop /fast Mode**: Fast mode in Codex desktop provides significantly better performance for rapid iteration, though users should monitor token spend carefully during intensive sessions. [link](https://x.com/danmana/status/2021611516546486664)\n- **Agent Reasoning Should Be Captured in Git**: Store agent reasoning and session logs in branches agents can reference later, creating collaborative memory between human and AI work sessions. [link](https://x.com/davidpwalter/status/2021609253681733976)\n\n## New Tools & Releases\n- **GLM-5 Now Available**: Chinese model GLM-5 debuts on Zai platform with strong early performance indicators, potentially running as 745B parameter MoE on 3x 512GB Mac Ultras locally. [link](https://x.com/TeksEdge/status/2021614020692951275)\n- **Qwen Image 2 Beats Nano Banana**: New 7B vision model (down from 20B) achieves higher Elo than competitors despite smaller parameter count, showing continued efficiency gains in multimodal models. [link](https://x.com/swyx/status/2021449840581099763)\n- **mini-SWE-agent 2.0 Released**: Simplest coding agent with near SOTA performance in just ~100 lines each for agent/model/environment, powering benchmarks and RL training at NVIDIA, Anyscale, Stanford. [link](https://x.com/KLieret/status/2021606142699356215)\n- **WildCat Attention**: Near-linear attention mechanism with super-polynomial error decay via spectrally-accurate optimally-weighted coresets, offering practical benefits for image generation and KV cache compression. [link](https://x.com/LesterMackey/status/2021598869327315095)\n- **SimpleMem Cross-Session Memory**: Agent memory system supporting lifecycle management, token-aware context injection, and auto decay/merge/pruning, outperforming Claude-Mem by +64% on recall tasks. [link](https://x.com/HuaxiuYaoML/status/2021595736203227260)"
  },
  {
    "timestamp": "2026-02-11 16:01:28",
    "description": "## Research & Papers\n- **Human-Centered Coding Agents Position Paper**: Research argues AI coding agents are over-optimized for solo autonomy instead of empowering human developers, calling for recalibration toward human-centered design. [link](https://x.com/ZhiruoW/status/2021603778982473813)\n- **Vision Tokens Are Interpretable with Right Tools**: New \"LatentLens\" method shows vision encoder representations are highly intelligible in language despite never being trained on it, suggesting modalities converge on same representations. [link](https://x.com/benno_krojer/status/2021601162349199404)\n- **Recursive Vision Transformers Work Surprisingly Well**: Experiments show 2-block recurrent transformer recovers 96% of DINOv2's accuracy, suggesting ViTs may be secretly operating as RNNs with depth-recurrence. [link](https://x.com/mozesjacobs/status/2021512823641542933)\n- **ChatGPT 5.2 Pro Proves Open Math Conjecture**: Extended thinking mode ran for 66 minutes to prove a learning theory result that stumped all models for months, showing long-form reasoning breakthrough. [link](https://x.com/damekdavis/status/2021612697180074326)\n\n## Community Highlights\n- **Codex Overtaking Claude for Many Use Cases**: Multiple developers report switching from Claude Code to Codex for most tasks, with Claude reserved only when Codex gets stuck—which rarely happens now. [link](https://x.com/TreyGri30839938/status/2021614413795541163)\n- **Matt Shumer's Viral AI Reality Check**: Article on AI's impact went unexpectedly viral with 4,297 likes, emphasizing importance of helping non-tech people understand coming changes. [link](https://x.com/mattshumer_/status/2021442589258391587)\n\n---\n*Curated from 500+ tweets across multiple sources*\n\n---\n\n## Emerging Trends\n\n✨ **Kimi K2.5** (42 mentions) - NEW\nKimi K2.5 is gaining traction as a cost-effective alternative to premium models, with users reporting significant cost savings (from $50/day to $4/day) while maintaining or improving performance compared to Sonnet 4-5.\n\n🔥 **Seedance 2.0 Video Generation** (68 mentions) - RISING\nByteDance's Seedance 2.0 video generation model is generating viral content, with users creating everything from \"Will Smith eating spaghetti\" remakes to action scenes. The model appears trained on TikTok data and can replicate various content styles instantly.\n\n🔥 **OpenClaw AI Agent Platform** (428 mentions) - RISING\nOpenClaw dominates with 151B tokens on OpenRouter (2x the second place). New integrations include X API search skills, girlfriend chatbot (Clawra), and debates about cost optimization, agent authentication, and whether to give agents full system access.\n\n📊 **Opus 4.6 Model Release** (285 mentions) - CONTINUING\nAnthropic's Opus 4.6 continues to generate discussion with mixed performance reports. Users praise its office work capabilities and extended thinking features, but note issues with speed, occasional crashes, and web search limitations compared to competitors.\n\n📊 **Codex/Claude Code Development** (312 mentions) - CONTINUING\nCodex and Claude Code continue as primary AI coding tools with ongoing debates about performance, speed improvements (60% faster), and new features like Chrome Extension building via Shipper. Users report both successes and frustrations with different use cases."
  }
]