[
  {
    "timestamp": "2026-02-20 16:01:01",
    "description": "# AI Digest - February 20, 2026\n\n## Industry News\n- **GGML joins Hugging Face**: The llama.cpp organization is joining Hugging Face to continue building ggml and make llama.cpp more accessible. Major consolidation in the open-source inference ecosystem. [link](https://x.com/ggerganov/status/2024873070180057391)\n\n- **Supreme Court strikes down Trump tariffs**: SCOTUS ruled 6-3 that Trump's global tariffs were unconstitutional, but Trump says he has backup plans using alternative legal authority. Could impact AI hardware supply chains. [link](https://x.com/WillRinehart/status/2024867342463750338)\n\n- **OpenAI working on AI devices**: OpenAI has 200+ people working on AI hardware including smart speakers, glasses, and lamps. Consumer AI hardware race intensifying. [link](https://x.com/btibor91/status/2024868103717552475)\n\n## Tips & Techniques\n- **Cloudflare MCP server uses Code Mode**: Cloudflare's API (2,500 endpoints = 1.17M tokens) now gives agents just 2 tools to write code that discovers the rest. 99.9% token reduction, massive efficiency win. [link](https://x.com/mattzcarey/status/2024872303864250681)\n\n- **CSV imports via staging database**: Every CSV import gets its own staging SQLite database in Relaticle V3 - nothing touches production until reviewed, failed rows export as CSV. Imports as workflows, not prayers. [link](https://x.com/MinasyanManuk/status/2024872966538883517)\n\n- **Vibe coding is a learnable skill**: Not obvious how to teach it, but it's measurably more efficient when done right. Requires slight shift in design thinking. [link](https://x.com/ibuildthecloud/status/2024871617818665022)\n\n## New Tools & Releases\n- **Gemini 3.1 Pro launches**: 77.1% on ARC-AGI-2 (more than doubling 3.0 Pro), strong at image-to-code, available via Gemini API, Google AI Studio, Vertex AI, Antigravity. Early reports mixed on real-world performance. [link](https://x.com/Thom_Wolf/status/2024874218098159668)\n\n- **Taalas runs Llama-3.1-8B at 17k tok/sec**: Custom hardware achieves 17,000 tokens per second with low latency by hard-wiring weights into silicon. No HBM, no liquid cooling. [link](https://x.com/AymericRoucher/status/2024859949944156417)\n\n- **DetectFlow open-sourced**: Detection intelligence engine runs Sigma detections on Kafka streams via Flink. Thousands of security rules in production. [link](https://x.com/SOC_Prime/status/2024870118963159308)\n\n## Research & Papers\n- **Stanford/Caltech LLM reasoning failures**: Review maps three failure patterns - Reversal Curse (trained on \"A is B\" fails \"B is A\"), Compositional Collapse (two-hop reasoning breaks), and systemic issues with multi-step workflows. [link](https://x.com/ivnardini/status/2024876761608225252)\n\n- **Personalized agents from human feedback (PAHF)**: New framework for continuous personalization - agents don't stay aligned with shifting preferences over time without explicit feedback loops. [link](https://x.com/kaiqu_liang/status/2024860356036706469)\n\n- **Efficient Probing (EP) for frozen encoders**: Lightweight multi-query attentive probing method unlocks potential of encoders optimized for local representations. Complementary with PEFT. Accepted at ICLR 2026. [link](https://x.com/bill_psomas/status/2024860749407875242)\n\n---\n*Curated from 500+ tweets across AI research, engineering, and product communities*\n\n---"
  },
  {
    "timestamp": "2026-02-20 16:01:02",
    "description": "## Emerging Trends\n\n✨ **Llama.cpp Team Joins Hugging Face** (35 mentions) - NEW\nMajor announcement that the llama.cpp team is joining Hugging Face, described as a \"match made in heaven\" by the community. Significant development for open-source AI infrastructure.\n\n🔥 **Gemini 3.1 Pro Release** (78 mentions) - RISING\nGoogle's Gemini 3.1 Pro model has been released and is available in AI Studio and Vertex AI. Users are reporting strong performance, particularly for image-to-code tasks and agentic reasoning.\n\n🔥 **Claude Code & Codex Development** (312 mentions) - RISING\nExtensive discussion of Claude Code and Codex with mentions of plan mode, subagent features, session portability, and comparisons between different coding agents. Teams discussing improvements and real-world usage patterns.\n\n🔥 **Emergent Labs $100M ARR** (42 mentions) - RISING\nEmergent Labs announced reaching $100M ARR in just 8 months, making it one of the fastest companies ever to reach this milestone. Major announcement with significant community discussion.\n\n📊 **OpenClaw AI Agent Platform** (485 mentions) - CONTINUING\nContinued strong discussion of OpenClaw with mentions of commercial wrappers like InstaClaw, security concerns about malicious packages on ClawHub, and first meetups being organized. The platform remains a major topic in the AI agent ecosystem."
  }
]