[
  {
    "timestamp": "2026-01-11 16:01:04",
    "description": "# AI Digest - January 11, 2026\n\n## Tips & Techniques\n- **Meta-Prompts Over Perfect Prompts**: Stop crafting \"perfect prompts\"—dump messy, unstructured info into one message and ask the model to \"write me a meta-prompt for ChatGPT that will...\" Instead of you optimizing prompts, let the model turn chaos into clarity and surface gaps early. [https://x.com/alexbemore/x/status/2010381188012314995](https://x.com/alexbemore/x/status/2010381188012314995)\n\n- **Claude Code as Interactive Tutor**: Set up Claude Code with planning enabled in one window and your editor in another. Tell it to only add code when explicitly prompted—this forces you to learn concepts actively rather than passively accepting suggestions. Works better than Cursor for learning. [https://x.com/KamStaszewski/status/2010362477465235577](https://x.com/KamStaszewski/status/2010362477465235577)\n\n- **Repeating Prompts Improves LLM Accuracy**: Simply repeating your prompt can make LLMs significantly more accurate—Google showed this wins 47 of 70 test cases. Trivial change, measurable improvement. [https://x.com/dioogfernands/status/2010343893229797706](https://x.com/dioogfernands/status/2010343893229797706)\n\n## New Tools & Releases\n- **Universal Commerce Protocol (UCP)**: Google & Shopify launched an open standard for agentic commerce that lets AI agents operate across discovery, buying, and post-purchase without unique connections for each agent. Works with existing protocols (A2A, AP2, MCP). [https://x.com/gaganghotra_/status/2010372473427316863](https://x.com/gaganghotra_/status/2010372473427316863)\n\n- **PUB (Public User Bot)**: Turn public domain documents (laws, archives, research papers, historical texts) into conversational AI. Make dormant public information navigable without having to reread hundreds of pages manually. Just launched beta. [https://x.com/clbtoort/status/2007376184850448661](https://x.com/clbtoort/status/2007376184850448661)\n\n- **OpenCode v1.1.11 + OpenAI Support**: After Anthropic blocked third-party tools, OpenCode added official GPT-5.2 & GPT-5.2-Codex support via ChatGPT Plus/Pro. OpenAI actively supporting third-party tools; Anthropic took opposite stance. [https://x.com/lucas_flatwhite/status/2010363459796664397](https://x.com/lucas_flatwhite/status/2010363459796664397)\n\n## Research & Papers\n- **Information Obeys Continuity Laws Like Energy**: New paper shows information has local density, flux, and sources/sinks—exactly like energy flow. Key insight: energy and information can decouple; systems can look active while becoming informationally opaque. Reframes why biological systems fail, why learning misaligns. [https://x.com/VFD_org/status/2010063773529149521](https://x.com/VFD_org/status/2010063773529149521)\n\n- **REM Sleep Drug Increases Sleep Quality 90%**: BMB-101 (Bright Minds) in Phase 2 trials slashed drug-resistant seizures 73% AND boosted REM sleep by 90 minutes (56→107 min) without increasing total sleep time—first drug ever to selectively supercharge REM. [https://x.com/ArczTM/status/2010378000274001921](https://x.com/ArczTM/status/2010378000274001921)\n\n- **AI Solves Erdős Problems in Math**: GPT-5.2 Pro generated proofs accepted by Terence Tao for Erdős problems (#397, #379). Marks shift from \"LLMs can't do frontier math\" to \"LLMs solve open problems.\" [https://x.com/neelsomani/status/2010378881535246516](https://x.com/neelsomani/status/2010378881535246516)"
  },
  {
    "timestamp": "2026-01-11 16:01:05",
    "description": "## Industry News\n- **Claude Code Crackdown vs OpenAI Collaboration**: Anthropic blocked third-party Claude access (OpenCode, xAI in Cursor) citing ToS violations; OpenAI immediately partnered with OpenCode offering GPT-5.2 support. Strategic divergence: Anthropic restrictive, OpenAI open. [https://x.com/lucas_flatwhite/status/2010363459796664397](https://x.com/lucas_flatwhite/status/2010363459796664397)\n\n- **\"Vibe Coding\" Enters Mainstream**: Linus Torvalds now using AI for code generation. Once fringe, vibe coding (rapid AI-assisted development) has crossed into even kernel development. Signals death of handcraft-only coding culture. [https://x.com/Mt_Hoot/status/2010380127017009605](https://x.com/Mt_Hoot/status/2010380127017009605)\n\n- **Claude Code Better Than ChatGPT for Serious Work**: Users report ChatGPT responses are \"verbose, made-up, always has things prompt never asked for.\" Claude now winning on quality; some canceling ChatGPT Pro subscriptions. Quality gap widening at inference time. [https://x.com/akshatk7/status/2010370850483290575](https://x.com/akshatk7/status/2010370850483290575)\n\n---\n*Curated from 800+ tweets*"
  }
]