[
  {
    "timestamp": "2026-01-29 16:00:58",
    "description": "# AI Digest - January 29, 2026\n\n## Tips & Techniques\n- **Claude Cowork for Knowledge Work**: Use it for routine tasks like scanning files, watching videos, uploading content, and trimming media. Respects manual inspection for irreversible actions and handles 9-stage autonomous plans efficiently. [link](https://x.com/swyx/status/2016899888718442842)\n\n- **Prompt Ranking with Unicode Ordering**: When LLMs output rankings/ordered lists, use Chinese characters or other non-ASCII Unicode instead of ABC/123—models follow positional patterns more reliably. [link](https://x.com/_vatsadev/status/2016888752447140231)\n\n- **Skill Patterns for Agent Consistency**: Understand the two-part skill architecture: deterministic commands (explicitly callable like /code-review) and prompt-based skills (loaded and auto-invoked contextually). Reading skills before adding them prevents unexpected behavior. [link](https://x.com/verrsane/status/2016753898761941301)\n\n- **Web Stack for Agents**: Design discovery layer (how agents find and learn capabilities), truth layer (authoritative data), negotiation layer (agent follow-ups), actions layer (execution), and governance layer (auth/permissions/auditing). [link](https://x.com/omergotlieb/status/2016897120532648046)\n\n## New Tools & Releases\n- **Qwen3-ASR Open Source**: First LLM-based ASR with native streaming support, handles messy real-world audio production-ready. [link](https://x.com/swyx/status/2016901994443833683)\n\n- **LlamaAgents Builder**: Describe workflows in English; automatically classifies and extracts different document types for agentic reasoning. Solves insurance claims intake with VLM accuracy. [link](https://x.com/jerryjliu0/status/2016902919187288261)\n\n- **Open Source Claude Cowork**: Desktop chat application using Claude Agent SDK and Composio Tool Router—full autonomous capabilities without cloud. [link](https://x.com/blaizedsouza/status/2016903690519527517)\n\n- **Variant UI**: Enter design ideas and scroll through endless beautiful variations—no canvas, no skills needed, just generative design at scroll speed. [link](https://x.com/yawnxyz/status/2016892498090864705)\n\n## Research & Papers\n- **Agents Perform 50% Worse in Teams (\"Curse of Coordination\")**: Multi-agent setups underperform single agents on sequential tasks. Critical for teams building human-AI collaboration systems. [link](https://x.com/justintchiu/status/2016882595699601685)\n\n- **Industrial Explosion Beats Intelligence Explosion**: Manufacturing automation with self-replicating robot factories could outpace software AGI in impact—doubling time ~1 year, plausible 5-10 year timeline to extreme capability. [link](https://x.com/bioshok3/status/2016835205764624394)\n\n- **LingBot-World: Playable World Model**: Open-source world simulator from video generation with real-time interactivity—agents can act inside generated environments. [link](https://x.com/wildmindai/status/2016889545325736097)\n\n## Industry News\n- **ElevenLabs Partners with Audi F1 Team**: Speech synthesis as official sponsor, expanding AI audio into motorsports infrastructure. [link](https://x.com/matiii/status/2016895333213868350)\n\n- **Twin Launches to Public with 3M Impressions**: Multi-agent platform ships webhooks, slides, video generation, image tools, GSheets integration—3x user growth in hours, infrastructure held. [link](https://x.com/hugomercierooo/status/2016886594326634579)\n\n- **AI Neutrality Report**: Anthropic, OpenAI, Google control 90% of model API revenue while competing with customers. Proposes net-neutrality-style regulation to prevent gatekeeping (e.g., Windsurf API access cuts). [link](https://x.com/asad09/status/2016893213571748116)\n\n---\n*Curated from 800+ tweets across AI engineering, research, and startup communities*"
  }
]