[
  {
    "timestamp": "2026-02-26 16:01:15",
    "description": "# AI Digest - February 26, 2026\n\n## Industry News\n- **Pentagon demands full control of Anthropic AI**: Pentagon issued \"best and final offer\" to Anthropic for unrestricted access to Claude, with decision deadline by Friday. Raises major questions about AI company independence and defense partnerships. [link](https://x.com/JenniferJJacobs/status/2027049596996727179)\n\n- **Anthropic stock impact hits India**: Indian IT stocks crashed 6% after Anthropic released enterprise AI tools that compete directly with traditional service providers. Legal plugin release triggered selloffs in Thomson Reuters (-21%), LegalZoom (-19%), CS Disco (-14%). [link](https://x.com/drupeek/status/2027049518320246926)\n\n- **Vercel support agent handles 90% of queries**: Vercel's AI support agent now resolves ~90% of customer inquiries autonomously, but team unable to upgrade from Claude Opus 4.5 to 4.6 without performance degradation. Shows \"best model\" is a moving target. [link](https://x.com/rauchg/status/2026844368246861858)\n\n- **Nano Banana 2 launches in Gemini**: Google's Gemini 3.1 Flash Image (Nano Banana 2) now live in Gemini apps, offering 50% cheaper image generation (~$0.16 per 4k image) with enhanced visual quality and text rendering vs original. [link](https://x.com/Angaisb_/status/2027050434133983363)\n\n## Tips & Techniques\n- **Ask agents if they're missing context**: When an agent isn't performing as expected, explicitly ask \"Are you missing any context?\" to surface overlooked requirements or constraints. Simple meta-prompt that improves output quality. [link](https://x.com/prasann_pandya/status/2026767563636510856)\n\n- **Think about tests first for agent development**: Highly recommend thinking about the test first when building agent features. Huge unlock for quality and reliability. [link](https://x.com/VoteforPedro/status/2027050182039244902)\n\n- **Large learning rates improve generalization**: Large learning rate at training start while annealing toward smaller one by end ALWAYS gives better empirical generalization. The \"shoot the minima\" fear is overblown. [link](https://x.com/drummatick/status/2027049472858161211)\n\n- **Don't invest in LLM guardrails**: Simple rule: Don't invest in guardrails for LLMs. Instead, invest in making everything flow easily into LLM context. Trust the magic of compounding. [link](https://x.com/adiletech/status/2027049099493625936)\n\n## New Tools & Releases\n- **Zvec: Embedded vector database**: Alibaba's Zvec is \"SQLite for vector databases\" - lightweight, zero-config, in-process vector DB with hybrid search and grouped search. Handles billion-scale vectors with millisecond latency. [link](https://x.com/shao__meng/status/2027039018051887583)\n\n- **Tamarind Bio raises $13.6M for molecular AI**: Platform serving tens of thousands of scientists including 8 of top 20 pharma. Library of hundreds of AI models, supports open models strengthened with proprietary data, prioritizes scientist access. [link](https://x.com/kavi_deniz/status/2027051035307770296)\n\n- **Faster Qwen3TTS at 4x realtime**: Realistic voice generation at 4x real time with same quality as Qwen's original model. Major speed improvement for voice applications. [link](https://x.com/andimarafioti/status/2027047792401629648)\n\n- **Claude Code gets Figma integration**: Starting today, generate Figma design files from Claude Code using Figma MCP server. Supports bidirectional workflow - UI to Figma canvas and back to code seamlessly. [link](https://x.com/p_gjorup/status/2027049183643832783)"
  },
  {
    "timestamp": "2026-02-26 16:01:16",
    "description": "## Research & Papers\n- **VLANeXt: Recipes for strong VLA models**: Systematic study of what actually matters for vision-language-action performance: policy heads, meta-queries, action chunking, flow matching. Provides actionable guidance for robotics developers. [link](https://x.com/KangLiao929/status/2027035945707655489)\n\n- **Truthfulness probes vary widely across domains**: Multiple orthogonal truthfulness directions shared across LLM honesty evals. Some generalize, others are domain-dependent. Proposes Truthfulness Multivector framework for more robust analysis. [link](https://x.com/zfjoshying/status/2027044456122274088)\n\n- **Mid-training bridges pre-training and supervised learning**: New research shows data that \"bridges\" pre-training and supervised learning is most effective for mid-training. Reveals optimal ratios and timing that aren't well documented in public research. [link](https://x.com/neubig/status/2027046844942209263)\n\n- **POCO predicts neural activity before it happens**: Can predict what one neuron will do next by knowing what entire brain is doing now. Tool paving way for adaptive neurotechnologies. [link](https://x.com/KanakaRajanPhD/status/2027043971847860612)\n\n---\n*Curated from 400+ tweets across AI research, tools, and industry lists*\n\n---\n\n## Emerging Trends\n\n✨ **Nano Banana 2 Release** (12 mentions) - NEW\nLaunch of Nano Banana 2 (NB2) image generation model in Gemini WebUI/App, with comparisons to Grok Imagine and discussions of its strengths in micro-level detail but weaknesses in macro-level world knowledge and temporal accuracy.\n\n🔥 **Cursor vs Claude Code vs Codex Competition** (145 mentions) - RISING\nDevelopers cycling between Cursor, Claude Code, and Codex tools, with discussions about workflow preferences, brain-off mode concerns, and the emotional attachment to code quality when using different AI coding assistants.\n\n🔥 **Claude Code Anniversary & Features** (98 mentions) - RISING\nClaude Code celebrating its 1-year anniversary with major feature releases including markdown table rendering, remote control capabilities, demo recording features, and Claude Cowork enterprise plugins marketplace for Google Workspace, Salesforce, Excel integration.\n\n🔥 **SaaS Disruption by AI Concerns** (102 mentions) - RISING\nDiscussions about AI tools like Anthropic's Claude Cowork threatening traditional SaaS businesses, with Indian IT stocks crashing 6% and debates about whether SaaS companies will need to dramatically lower margins or face extinction from AI automation.\n\n📊 **AI Job Displacement & Economic Impact** (87 mentions) - CONTINUING\nViral discussions around Citrini's scenario about AI-driven job displacement, fiscal policy responses, and debates about whether AI will lead to abundance/aristocracy for everyone or permanent underclass, with references to the Atlantic article generating strong reactions."
  }
]