[
  {
    "timestamp": "2026-02-28 16:01:11",
    "description": "# AI Digest - February 28, 2026\n\n## Industry News\n- **Anthropic designated \"supply chain risk\" by Pentagon**: After refusing to remove safety guardrails for mass surveillance and autonomous weapons, Anthropic faces government contract cancellation while OpenAI accepts similar terms. [link](https://x.com/const_reborn/status/2027768796845347161)\n- **OpenAI-Pentagon deal includes different terms than Anthropic's**: Despite initial reports of identical contracts, fine print reveals OpenAI's agreement differs on weapons autonomy and surveillance scope. [link](https://x.com/JoshKale/status/2027766139242139907)\n- **Block lays off 40% citing AI**: Mass layoffs hit fintech as companies accelerate AI replacement of entry-level roles. [link](https://x.com/alexcooldev/status/2027608429167317091)\n\n## Tips & Techniques\n- **AGENTS.md files don't scale beyond modest codebases**: New paper shows three-tier memory architecture (hot constitution, domain experts, cold knowledge base) enabled 108k-line C# system across 283 sessions with 6 autonomous turns per human prompt. [link](https://x.com/omarsar0/status/2027770787659464812)\n- **Mistral OCR + batch is unbeatable for invoice extraction**: Simple combination delivers industrial-grade document processing. [link](https://x.com/pontusab/status/2027773272964911579)\n- **How to properly set up Claude Cowork**: Detailed guide on context files, global instructions, and plugin configuration for getting AI to work like a true coworker while you're away. [link](https://x.com/lucas_flatwhite/status/2027763806001393768)\n\n## New Tools & Releases\n- **Claude Code /batch and /simplify commands**: New parallel agent features enable simultaneous PRs and auto code cleanup across entire codebases. [link](https://x.com/minchoi/status/2027774710197391519)\n- **Graph-RAG framework for multi-hop reasoning**: New architecture enables complex reasoning chains across knowledge graphs. [link](https://x.com/tom_doerr/status/2027774276233798081)\n- **Perplexity releases 4 open-weights multilingual embedding models**: State-of-the-art retrieval models designed for production use. [link](https://x.com/tomaarsen/status/2027765950125052347)\n\n## Research & Papers\n- **Codified Context paper**: Documents production three-tier agent memory system that enabled 108k-line codebase development with knowledge-to-code ratio of 24.2%. [link](https://x.com/omarsar0/status/2027770787659464812)\n- **SymTorch enables symbolic analysis of trained models**: New framework reveals what deep learning models actually learned, not just their outputs. [link](https://x.com/liztansz/status/2027770754062864855)\n- **Self-Sustaining Rewards (SSR) improves without human data**: Models achieve +10.4 on SWE-bench through self-play, consistently outperforming human-data baseline despite evaluation on natural language issues absent from training. [link](https://x.com/m_shalia/status/2027775029576929497)\n\n## Contrarian Takes\n- **\"AI slop\" blames the wrong thing**: The problem isn't AI output quality—it's that humans prompt for garbage, train on garbage, then blame the tool for producing what was requested. [link](https://x.com/m_shalia/status/2027772302868550032)\n- **Karpathy: CLIs are the killer app for AI agents**: Legacy command-line tools become powerful when agents can natively combine them; building for agents means CLI-first design. [link](https://x.com/karpathy/status/2026360908398862478)\n- **Anthropic's stance may attract top talent**: Despite government pressure, taking a principled position on autonomous weapons could become a major recruiting advantage. [link](https://x.com/dbreunig/status/2027773909836435888)\n\n---\n*Curated from 500+ tweets across 15 tech professional lists*\n\n---"
  },
  {
    "timestamp": "2026-02-28 16:01:11",
    "description": "## Emerging Trends\n\n✨ **Codex Desktop App Launch** (142 mentions) - NEW\nOpenAI's Codex Desktop app is receiving significant praise as a powerful coding interface, with many developers switching from terminal-based workflows and comparing it favorably to Claude Code.\n\n✨ **Iran Conflict Escalation** (89 mentions) - NEW\nMajor geopolitical crisis as Iran launched missile strikes on UAE and other Middle East targets, with US military operations intensifying and concerns about impacts on AI infrastructure in the region.\n\n🔥 **OpenAI $110B Funding Round** (195 mentions) - RISING\nOpenAI announced a $110 billion funding round from Amazon, NVIDIA, and SoftBank, garnering massive attention and discussion about AI company valuations and the future of the industry.\n\n🔥 **Anthropic DoD Dispute** (168 mentions) - RISING\nAnthropic's conflict with the Department of Defense over AI use in autonomous weapons and surveillance escalated, with the Pentagon designating them as a supply chain risk and threatening use of the Defense Production Act.\n\n📊 **Nano Banana 2 Release** (67 mentions) - CONTINUING\nGoogle's Nano Banana 2 image generation model launched with comparisons to Grok Imagine and other models, though mixed reviews on quality and world knowledge compared to competitors."
  }
]