[
  {
    "timestamp": "2026-02-25 16:01:14",
    "description": "# AI Digest - February 25, 2026\n\n## Industry News\n- **Anthropic-Pentagon standoff over autonomous weapons**: Anthropic is reportedly refusing Pentagon demands under the Defense Production Act to remove safety guardrails for military AI applications, with a Friday deadline looming. The dispute centers on whether AI systems should be able to autonomously make lethal decisions without human oversight. [link](https://x.com/deanwball/status/2026686191219740823)\n\n- **Hyperscaler contracts being canceled overseas**: Major US cloud provider contracts are starting to be canceled by governments and enterprises outside the US, signaling a shift toward AI infrastructure independence that will likely appear in Q3/Q4 earnings reports. [link](https://x.com/AnjneyMidha/status/2026687095801369036)\n\n- **Qwen 3.5 Medium models released**: Alibaba released Qwen3.5 medium series including a 27B dense model and MoE variants (35B-A3B, 122B-A10B, 397B-A17B), with the 27B achieving 48.5% on Humanity's Last Exam—beating much larger models and maintaining near-lossless accuracy under 4-bit quantization. [link](https://x.com/Alibaba_Qwen/status/2026684744476063997)\n\n- **Mercury 2 diffusion LLM launches**: Inception Labs released Mercury 2, the first reasoning diffusion LLM delivering 5x faster performance than leading speed-optimized models, representing a new architectural approach to language generation. [link](https://x.com/StefanoErmon/status/2026687445689872452)\n\n## Tips & Techniques\n- **If an agent isn't doing what you want, ask it: \"Are you missing any context?\"**: Simple prompt technique that helps agents identify gaps in their understanding rather than making incorrect assumptions. [link](https://x.com/bcherny/status/2026449617915884009)\n\n- **Put static calibration prompts before dynamic content for KV-cache reuse**: In LLM-as-a-judge setups, place the calibration prompt first so attention states can be computed once and reused across queries, rather than recomputing the entire sequence each time. [link](https://x.com/AradhyeAgarwal/status/2026687778986275138)\n\n- **CLI tools are the new API for AI agents**: Agents can natively use command-line interfaces to install, combine, and interact with tools via the entire terminal toolkit—making CLIs more accessible than traditional APIs for agent-to-tool communication. [link](https://x.com/karpathy/status/2026360908398862478)\n\n- **Design verification loops into agent workflows**: Self-verification is becoming critical for agent reliability—invest in vision-based feedback (screenshots), environment snapshots, and automated testing rather than just generation compute. [link](https://x.com/Vtrivedy10/status/2026680125186556002)\n\n## New Tools & Releases\n- **Claude Code Remote Control**: Anthropic rolled out a research preview feature allowing Claude Code sessions to be controlled from mobile devices, enabling developers to continue coding sessions while away from their desktop. [link](https://x.com/noahzweben/status/2026664375319253438)\n\n- **Entire CLI + OpenCode collaboration**: The Entire CLI and OpenCode are now working together as open-source projects to create a universal reasoning layer for all agents, enabling step-by-step agent collaboration. [link](https://x.com/ashtom/status/2026347974742434005)\n\n- **OpenClaw 2026.2.24 ships**: New release includes stop phrases in 10+ languages, improved typing indicators, and better multi-language support for the AI agent platform. [link](https://x.com/openclaw/status/2026673372109635697)\n\n- **datasets v4.6.0 with Xet optimizations**: HuggingFace datasets library now supports push_to_hub() for video datasets, stores media as plain blobs in Parquet, and enables .reshard() for streaming datasets with row-group-level sharding. [link](https://x.com/lhoestq/status/2026687701194285373)"
  },
  {
    "timestamp": "2026-02-25 16:01:15",
    "description": "## Research & Papers\n- **LLMs encode truthfulness both abstractly and domain-specifically**: New research reconciles conflicting findings about truthfulness probes, showing both abstract and domain-specific truth directions exist—an erasure-based procedure can identify them. [link](https://x.com/ravfogel/status/2026687189577334815)\n\n- **Test-time training proven equivalent to linear attention**: Researchers mathematically proved that test-time training (TTT) with KV binding and linear attention are equivalent, both operating at O(1) memory and O(n) compute complexity. [link](https://x.com/ruilong_li/status/2026684465259622592)\n\n- **Rubric-Induced Preference Drift (RIPD) identified**: Study shows that evaluation rubrics in LLM-as-a-judge pipelines can silently alter alignment—benchmark scores remain stable while judge preferences shift on unseen domains by up to 27.9%. [link](https://x.com/zhun_deng/status/2026687048493453681)\n\n- **Most LLM benchmarks are redundant and low-rank**: New analysis using SVD shows that most LLM eval scores can be predicted from just two dimensions (general knowledge + novel reasoning), with only a few benchmarks like TerminalBench measuring genuinely new capabilities. [link](https://x.com/blissfulchar/status/2026676193555263538)\n\n---\n*Curated from 500+ tweets across AI research and development communities*\n\n---\n\n## Emerging Trends\n\n✨ **Agentic Workflow Architecture** (143 mentions) - NEW\nDiscussion of \"taste-driven development,\" multi-agent orchestration, parallel worktrees, and the shift from typing code to steering AI systems. Developers sharing frameworks for managing multiple agents, context switching, and maintaining code quality at scale.\n\n✨ **SaaS Disruption by AI** (89 mentions) - NEW\nDebate over whether AI eliminates SaaS moats through reduced implementation complexity (SAML, features taking days not months) versus whether moats like customer trust and network effects still matter. Discussion of \"software development lifecycle is dead\" thesis.\n\n🔥 **OpenClaw Customization & Production Use** (156 mentions) - RISING\nUsers sharing extensive OpenClaw setups with custom memory systems, skills, autonomous loops, and security configurations. Focus on transforming basic chatbot into \"AI employee\" through file structure customization, memory architecture, and safety audits.\n\n🔥 **Gemini 3.1 Pro Release** (94 mentions) - RISING\nMajor excitement around Gemini 3.1 Pro's capabilities, particularly for creating skeuomorphic UIs, animations, and visual design. Users praising its photorealistic output and improvements over previous versions, with detailed prompting workflows being shared.\n\n📊 **Cursor vs Claude Code vs Codex Competition** (127 mentions) - CONTINUING\nDevelopers actively debating and switching between coding tools (Cursor, Claude Code, Codex, OpenCode), with many going \"full circle\" back to Cursor. Poll shows Codex beating Claude Code 54-46, indicating continued competition and user preferences shifting."
  }
]